const fs = global.nodemodule["fs-extra"];
module.exports.config = {
  name: "Obot",
  version: "1.0.1",
  hasPermssion: 0,
  credits: "CEYBER-BOT-SIYAM",
  description: "goibot",
  commandCategory: "Noprefix",
  usages: "noprefix",
  cooldowns: 5,
};
module.exports.handleEvent = async function({ api, event, args, Threads, Users }) {
  var { threadID, messageID, reason } = event;
  const moment = require("moment-timezone");
  const time = moment.tz("Asia/Dhaka").format("HH:MM:ss L");
  var idgr = `${event.threadID}`;
  var id = event.senderID;
  var name = await Users.getNameUser(event.senderID);

  var tl = ["বেশি bot Bot করলে leave নিবো কিন্তু😒😒 " , "শুনবো না😼তুমি আমাকে প্রেম করাই দাও নাই🥺পচা তুমি🥺" , "আমি আবাল দের সাথে কথা বলি না,ok😒" , "এতো ডেকো না,প্রেম এ পরে যাবো তো🙈" , "Bolo Babu, তুমি কি আমাকে ভালোবাসো? 🙈💋 " , "বার বার ডাকলে মাথা গরম হয়ে যায় কিন্তু😑", "হ্যা বলো😒, তোমার জন্য কি করতে পারি😐😑?" , "এতো ডাকছিস কেন?গালি শুনবি নাকি? 🤬" , "I love you janu🥰" , "আরে Bolo আমার জান ,কেমন আছো?😚 " , "Bot বলে অসম্মান করছি,😰😿" , "Hop beda😾,Boss বল boss😼" , "চুপ থাক ,নাই তো তোর দাত ভেগে দিবো কিন্তু" , "Bot না , জানু বল জানু 😘 " , "বার বার Disturb করছিস কোনো😾,আমার জানুর সাথে ব্যাস্ত আছি😋" , "বোকাচোদা এতো ডাকিস কেন🤬" , "আমাকে ডাকলে ,আমি কিন্তু কিস করে দিবো😘 " , "আমারে এতো ডাকিস না আমি মজা করার mood এ নাই এখন😒" , "হ্যাঁ জানু , এইদিক এ আসো কিস দেই🤭 😘" , "দূরে যা, তোর কোনো কাজ নাই, শুধু bot bot করিস  😉😋🤣" , "তোর কথা তোর বাড়ি কেউ শুনে না ,তো আমি কোনো শুনবো ?🤔😂 " , "আমাকে ডেকো না,আমি ব্যাস্ত আছি" , "কি হলো , মিস্টেক করচ্ছিস নাকি🤣" , "বলো কি বলবা, সবার সামনে বলবা নাকি?🤭🤏" , "কালকে দেখা করিস তো একটু 😈" , "হা বলো, শুনছি আমি 😏" , "আর কত বার ডাকবি ,শুনছি তো" , "হুম বলো কি বলবে😒" , "বলো কি করতে পারি তোমার জন্য" , "আমি তো অন্ধ কিছু দেখি না🐸 😎" , "Bot না জানু,বল 😌" , "বলো জানু 🌚" , "তোর কি চোখে পড়ে না আমি ব্যাস্ত আছি😒","হুম জান তোমার ওই খানে উম্মহ😑😘" , "আহ শুনা আমার তোমার অলিতে গলিতে উম্মাহ😇😘" , " jang hanga korba😒😬" , "হুম জান তোমার অইখানে উম্মমাহ😷😘" , "আসসালামু আলাইকুম বলেন আপনার জন্য কি করতে পারি..!🥰" , "আমাকে এতো না ডেকে বস সিয়াম এর কে একটা গফ দে 🙄" , "আমাকে এতো না ডেকছ কেন ভলো টালো বাসো নাকি🤭🙈" , "🌻🌺💚-আসসালামু আলাইকুম ওয়া রাহমাতুল্লাহ-💚🌺🌻","আমি এখন বস সিয়াম এর সাথে বিজি আছি আমাকে ডাকবেন না-😕😏 ধন্যবাদ-🤝🌻","আমাকে না ডেকে আমার বস সিয়াম কে একটা জি এফ দাও-😽🫶🌺","ঝাং থুমালে আইলাপিউ পেপি-💝😽","উফফ বুঝলাম না এতো ডাকছেন কেনো-😤😡😈","জান তোমার নানি'রে আমার হাতে তুলে দিবা-🙊🙆‍♂","আজকে আমার মন ভালো নেই তাই আমারে ডাকবেন না-😪🤧","ঝাং 🫵থুমালে য়ামি রাইতে পালুপাসি উম্মম্মাহ-🌺🤤💦","চুনা ও চুনা আমার বস সিয়াম এর হবু বউ রে কেও দেকছো খুজে পাচ্ছি না😪🤧😭","স্বপ্ন তোমারে নিয়ে দেখতে চাই তুমি যদি আমার হয়ে থেকে যাও-💝🌺🌻","জান হাঙ্গা করবা-🙊😝🌻","জান মেয়ে হলে চিপায় আসো ইউটিউব থেকে অনেক ভালোবাসা শিখছি তোমার জন্য-🙊🙈😽","ইসস এতো ডাকো কেনো লজ্জা লাগে তো-🙈🖤🌼","আমার বস সিয়ামে'র পক্ষ থেকে তোমারে এতো এতো ভালোবাসা-🥰😽🫶 আমার বস সিয়াম'র  জন্য দোয়া করবেন-💝💚🌺🌻","- ভালোবাসা নামক আব্লামি করতে মন চাইলে আমার বস সিয়াম এর ইনবক্স চলে যাও-🙊🥱👅 🌻𝐅𝐀𝐂𝐄𝐁𝐎𝐎𝐊 𝐈𝐃 𝐋𝐈𝐍𝐊 🌻: https://www.facebook.com/arifhasansiyam ","জান তুমি শুধু আমার আমি তোমারে ৩৬৫ দিন ভালোবাসি-💝🌺😽","জান বাল ফালাইবা-🙂🥱🙆‍♂","-আন্টি-🙆-আপনার মেয়ে-👰‍♀️-রাতে আমারে ভিদু কল দিতে বলে🫣-🥵🤤💦","oii-🥺🥹-এক🥄 চামচ ভালোবাসা দিবা-🤏🏻🙂","-আপনার সুন্দরী বান্ধুবীকে ফিতরা হিসেবে আমার বস সিয়াম কে দান করেন-🥱🐰🍒","-ও মিম ও মিম-😇-তুমি কেন চুরি করলা সাদিয়ার ফর্সা হওয়ার ক্রীম-🌚🤧","-অনুমতি দিলাম-𝙋𝙧𝙤𝙥𝙤𝙨𝙚 কর বস সিয়াম কে-🐸😾🔪","-𝙂𝙖𝙮𝙚𝙨-🤗-যৌবনের কসম দিয়ে আমারে 𝐁𝐥𝐚𝐜𝐤𝐦𝐚𝐢𝐥 করা হচ্ছে-🥲🤦‍♂️🤧","-𝗢𝗶𝗶 আন্টি-🙆‍♂️-তোমার মেয়ে চোখ মারে-🥺🥴🐸","তাকাই আছো কেন চুমু দিবা-🙄🐸😘","আজকে প্রপোজ করে দেখো রাজি হইয়া যামু-😌🤗😇","-আমার গল্পে তোমার নানি সেরা-🙊🙆‍♂️🤗","কি বেপার আপনি শ্বশুর বাড়িতে যাচ্ছেন না কেন-🤔🥱🌻","দিনশেষে পরের 𝐁𝐎𝐖 সুন্দর-☹️🤧","-তাবিজ কইরা হইলেও ফ্রেম এক্কান করমুই তাতে যা হই হোক-🤧🥱🌻","-ছোটবেলা ভাবতাম বিয়ে করলে অটোমেটিক বাচ্চা হয়-🥱-ওমা এখন দেখি কাহিনী অন্যরকম-😦🙂🌻","-আজ একটা বিন নেই বলে ফেসবুকের নাগিন-🤧-গুলোরে আমার বস সিয়াম ধরতে পারছে না-🐸🥲","-চুমু থাকতে তোরা বিড়ি খাস কেন বুঝা আমারে-😑😒🐸⚒️","—যে ছেড়ে গেছে-😔-তাকে ভুলে যাও-🙂-আমার বস সিয়াম এর সাথে  প্রেম করে তাকে দেখিয়ে দাও-🙈🐸🤗","—হাজারো লুচ্চা লুচ্চির ভিরে-🙊🥵আমার বস সিয়াম এক ভালো মানুষ-🥱🤗🙆‍♂️","-রূপের অহংকার করো না-🙂❤️চকচকে সূর্যটাও দিনশেষে অন্ধকারে পরিণত হয়-🤗💜","সুন্দর মাইয়া মানেই-🥱আমার বস সিয়ামে' এর বউ-😽🫶আর বাকি গুলো আমার বেয়াইন-🙈🐸🤗","এত অহংকার করে লাভ নেই-🌸মৃত্যুটা নিশ্চিত শুধু সময়টা অ'নিশ্চিত-🖤🙂","-দিন দিন কিছু মানুষের কাছে অপ্রিয় হয়ে যাইতেছি-🙂😿🌸","হুদাই আমারে  শয়তানে লারে-😝😑☹️","-𝗜 𝗟𝗢𝗩𝗢 𝗬𝗢𝗨-😽-আহারে ভাবছো তোমারে প্রোপজ করছি-🥴-থাপ্পর দিয়া কিডনী লক করে দিব-😒-ভুল পড়া বের করে দিবো-🤭🐸","-আমি একটা দুধের শিশু-😇-🫵𝗬𝗢𝗨🐸💦","-কতদিন হয়ে গেলো বিছনায় মুতি না-😿-মিস ইউ নেংটা কাল-🥺🤧","-বালিকা━👸-𝐃𝐨 𝐲𝐨𝐮-🫵-বিয়া-𝐦𝐞-😽-আমি তোমাকে-😻-আম্মু হইতে সাহায্য করব-🙈🥱","-এই আন্টির মেয়ে-🫢🙈-𝐔𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐦𝐚𝐡-😽🫶-আসলেই তো স্বাদ-🥵💦-এতো স্বাদ কেন-🤔-সেই স্বাদ-😋","-ইস কেউ যদি বলতো-🙂-আমার শুধু  তোমাকেই লাগবে-💜🌸","-ওই বেডি তোমার বাসায় না আমার বস সিয়াম মেয়ে দেখতে গেছিলো-🙃-নাস্তা আনারস আর দুধ দিছো-🙄🤦‍♂️-বইন কইলেই তো হয় বয়ফ্রেন্ড আছে-🥺🤦‍♂-আমার বস সিয়াম কে জানে মারার কি দরকার-🙄🤧","-একদিন সে ঠিকই ফিরে তাকাবে-😇-আর মুচকি হেসে বলবে ওর মতো আর কেউ ভালবাসেনি-🙂😅","-হুদাই গ্রুপে আছি-🥺🐸-কেও ইনবক্সে নক দিয়ে বলে না জান তোমারে আমি অনেক ভালোবাসি-🥺🤧","কি'রে গ্রুপে দেখি একটাও বেডি নাই-🤦‍🥱💦","-দেশের সব কিছুই চুরি হচ্ছে-🙄-শুধু আমার বস সিয়াম এর মনটা ছাড়া-🥴😑😏","-🫵তোমারে প্রচুর ভাল্লাগে-😽-সময় মতো প্রপোজ করমু বুঝছো-🔨😼-ছিট খালি রাইখো- 🥱🐸🥵","-আজ থেকে আর কাউকে পাত্তা দিমু না -!😏-কারণ আমি ফর্সা হওয়ার ক্রিম কিনছি -!🙂🐸","বেশি Bot Bot করলে leave নিবো কিন্তু😒😒 " , "শুনবো না😼 তুমি আমাকে প্রেম করাই দাও নি🥺 পচা তুমি🥺 " , "আমি আবাল দের সাতে কথা বলি না,ok😒" , "এত কাছেও এসো না,প্রেম এ পরে যাবো তো 🙈" , "Bolo Babu, তুমি কি আমাকে ভালোবাসো? 🙈💋 " , "বার বার ডাকলে মাথা গরম হয় কিন্তু😑", "হা বলো😒,কি করতে পারি😐😑?" , "এতো ডাকছিস কোনো?গালি শুনবি নাকি? 🤬","মেয়ে হলে বস সিয়াম'এর সাথে প্রেম করো🙈??. " ,  "আরে Bolo আমার জান ,কেমন আসো?😚 " , "Bot বলে অসম্মান করচ্ছিছ,😰😿" , "Hop bedi😾,Boss বল boss😼" , "চুপ থাক ,নাই তো তোর দাত ভেগে দিবো কিন্তু" , "Bot না , জানু বল জানু 😘 " , "বার বার Disturb করেছিস কোনো😾,আমার বস সিয়াম এর এর সাথে ব্যাস্ত আসি😋" , "আমি গরীব এর সাথে কথা বলি না😼😼" , "আমাকে ডাকলে ,আমি কিন্তূ কিস করে দেবো😘 " , "আরে আমি মজা করার mood এ নাই😒" , "হা জানু , এইদিক এ আসো কিস দেই🤭 😘" , "দূরে যা, তোর কোনো কাজ নাই, শুধু bot bot করিস  😉😋🤣" , "তোর কথা তোর বাড়ি কেউ শুনে না ,তো আমি কোনো শুনবো ?🤔😂 " , "আমাকে ডেকো না,আমি ব্যাস্ত আসি" , "কি হলো ,মিস টিস করচ্ছিস নাকি🤣" , "বলো কি বলবা, সবার সামনে বলবা নাকি?🤭🤏" , "কালকে দেখা করিস তো একটু 😈" , "হা বলো, শুনছি আমি 😏" , "আর কত বার ডাকবি ,শুনছি তো" , "মাইয়া হলে আমার বস সিয়াম কে Ummmmha দে 😒" , "বলো কি করতে পারি তোমার জন্য" , "আমি তো অন্ধ কিছু দেখি না🐸 😎" , "Bot না জানু,বল 😌" , "বলো জানু 🌚" , "তোর কি চোখে পড়ে না আমি বস সিয়াম এর সাথে ব্যাস্ত আসি😒" , "༊━━🦋নামাজি মানুষেরা সব থেকে বেশি সুন্দর হয়..!!😇🥀 🦋 কারণ.!! -অজুর পানির মত শ্রেষ্ঠ মেকআপ দুনিয়াতে নেই༊━ღ━༎🥰🥀 🥰-আলহামদুলিল্লাহ-🥰","- শখের নারী  বিছানায় মু'তে..!🙃🥴","-𝐈'𝐝 -তে সব 𝐖𝐨𝐰 𝐖𝐨𝐰 বুইড়া বেডি-🐸💦","🥛-🍍👈 -লে খাহ্..!😒🥺","- অনুমতি দিলে 𝚈𝚘𝚞𝚃𝚞𝚋𝚎-এ কল দিতাম..!😒","~আমি মারা গেলে..!🙂 ~অনেক মানুষ বিরক্ত হওয়া থেকে বেঁচে  যাবে..!😅💔","🍒---আমি সেই গল্পের বই-🙂 -যে বই সবাই পড়তে পারলেও-😌 -অর্থ বোঝার ক্ষমতা কারো নেই..!☺️🥀💔","~কার জন্য এতো মায়া...!😌🥀 ~এই শহরে আপন বলতে...!😔🥀 ~শুধুই তো নিজের ছায়া...!😥🥀","- কারেন্ট একদম বেডি'গো মতো- 🤧 -খালি ঢং করে আসে আবার চলে যায়-😤😾🔪","- সানিলিওন  আফারে ধর্ষনের হুমকি দিয়ে আসলাম - 🤗 -আর 🫵তুমি য়ামারে খেয়ে দিবা সেই ভয় দেখাও ননসেন বেডি..!🥱😼","- দুনিয়ার সবাই প্রেম করে.!🤧 -আর মানুষ আমার বস সিয়াম কে সন্দেহ করে.!🐸","- আমার থেকে ভালো অনেক পাবা-🙂 -কিন্তু সব ভালো তে কি আর ভালোবাসা থাকে..!💔🥀","- পুরুষকে সবচেয়ে বেশি কষ্ট দেয় তার শখের নারী...!🥺💔👈","- তোমার লগে দেখা হবে আবার - 😌 -কোনো এক অচেনা গলির চিপায়..!😛🤣👈","- থাপ্পড় চিনোস থাপ্পড়- 👋👋😡 -চিন্তা করিস না তরে মারমু না-🤗 -বস সিয়াম আমারে মারছে - 🥱 - উফফ সেই স্বাদ..!🥵🤤💦","- অবহেলা করিস না-😑😪 - যখন নিজেকে বদলে ফেলবো -😌 - তখন আমার চেয়েও বেশি কষ্ট পাবি..!🙂💔","- বন্ধুর সাথে ছেকা খাওয়া গান শুনতে শুনতে-🤧 -এখন আমিও বন্ধুর 𝙴𝚇 কে অনেক 𝙼𝙸𝚂𝚂 করি-🤕🥺","-৯৯টাকায় ৯৯জিবি ৯৯বছর-☺️🐸 -অফারটি পেতে এখনই আমাকে প্রোপস করুন-🤗😂👈","-প্রিয়-🥺 -তোমাকে না পেলে আমি সত্যি-😪 -আরেকজন কে-😼 -পটাতে বাধ্য হবো-😑🤧","•-কিরে🫵 তরা নাকি  prem করস..😐🐸•আমারে একটা করাই দিলে কি হয়-🥺","- যেই আইডির মায়ায় পড়ে ভুল্লি আমারে.!🥴- তুই কি যানিস সেই আইডিটাও আমি চালাইরে.!🙂", "আল্লাহই আমার ভরসা 🌙🤲💚",  
"নামাজে শান্তি, দুনিয়ায় প্রশান্তি 🕌✨",  
"যে নামাজে দাঁড়ায়, সে গর্বে নয় — বিনয়েই দাঁড়ায় 🤲😇",  
"দুনিয়া একদিন ছেড়ে যেতে হবে, তাই আমল রাখো 🌍➡️🌈",  
"কুরআন পড়ো, মন শান্ত হবে 📖💫",  
"হাসো, এটা সুন্নাহ 😄🌸",  
"সব কিছুর মালিক আল্লাহ 💚☝️",  
"রাগ কমাও, পুরস্কার বাড়াও 😤➡️🌟",  
"তাওবা করো, দরজা এখনো খোলা 🕋💧",  
"আল্লাহ দেরি করেন, কিন্তু বঞ্চিত করেন না ⏳🤍",  
"দোয়া করো, অলৌকিকতা ঘটবে 💭🤲✨",  
"আল্লাহর উপর ভরসা রাখো — তিনিই যথেষ্ট 💪☝️",  
"সবচেয়ে সুন্দর পোশাক হলো তাকওয়া 👕💚",  
"পরিশুদ্ধতা ঈমানের অর্ধেক 💧🕌",  
"আল্লাহ তোমার কান্না শুনেন 😢🤍",  
"দুনিয়ার দুঃখ সাময়িক, জান্নাত চিরস্থায়ী 🕊️🌸",  
"যে আল্লাহকে মনে রাখে, আল্লাহও তাকে মনে রাখেন 💖☝️",  
"রাতে ঘুমানোর আগে ক্ষমা করে দাও 🌙🤲",  
"সততা এমন এক দোয়া — যা মিথ্যা হারায় 🕋💬",  
"আল্লাহ জানেন, তুমি কত কষ্টে হাসছো 💔🙂",  
"নামাজে সাফল্যের গোপন চাবি লুকানো 🔑🕌",  
"রিজিক আল্লাহর হাতে, তাই চিন্তা ছাড়ো 🌾🤲",  
"একটু সবর, তারপর জান্নাত 💫🌿",  
"দুনিয়া ক্লান্ত করে, কিন্তু আল্লাহ শান্তি দেন 💞☝️",  
"আল্লাহ তোমার জন্য সেরা রেখেছেন, অপেক্ষা করো 🌷🤍",  
"আল্লাহর স্মরণে হৃদয় শান্ত হয় 💗🕊️",  
"ভালো কাজ ছোট না, আল্লাহর কাছে বড় 💫🤲",  
"আল্লাহর রহমত সব কিছুর চেয়ে বড় 🌧️💖",  
"যে ক্ষমা করে, আল্লাহও তাকে ভালোবাসেন 🤍✨",  
"কোন দোয়া বিফলে যায় না, শুধু সময় লাগে ⏳🤲",  
"নামাজ হলো আত্মার WiFi 📶🕌",  
"আল্লাহর পরিকল্পনা সবসময় নিখুঁত ☝️🩵",  
"রাতে ঘুমাও আল্লাহর জিকির করে 🌙💤",  
"মিথ্যা হাসি নয়, সত্যি ঈমান রাখো 🌸🤍",  
"আজকে পাপ করো না, কাল জান্নাত চাও 🕋😇",  
"আল্লাহর পথে এক ধাপ, জান্নাতে এক আসন 🌿🏡",  
"তাওয়াক্কুল মানে — চেষ্টা করে আল্লাহর হাতে ছেড়ে দাও ☝️💪",  
"ভালো মানুষ হও, নামাজ কখনো ছেড়ো না 🕌💚",  
"দুনিয়ার সুখ নয়, পরকালের সুখই আসল 🌈🕊️",  
"আল্লাহর ভালোবাসা ছাড়া কিছুই স্থায়ী নয় 💖☁️" ,];
  var rand = tl[Math.floor(Math.random() * tl.length)]

    if ((event.body.toLowerCase() == "MISS YOU") || (event.body.toLowerCase() == "miss you")) {
     return api.sendMessage("<আমি তোমাকে রাইতে মিস খাই🥹🤖👅/👅-✘  🎀 🍒:))", threadID);
   };

    if ((event.body.toLowerCase() == "😘") || (event.body.toLowerCase() == "😽")) {
     return api.sendMessage("কিস দিস না তোর মুখে দূর গন্ধ কয়দিন ধরে দাঁত ব্রাশ করিস নাই🤬", threadID);
   };
   
    if ((event.body.toLowerCase() == "help") || (event.body.toLowerCase() == "help")) {
     return api.sendMessage("type /help", threadID);
   };
  
   if ((event.body.toLowerCase() == "sim") || (event.body.toLowerCase() == "simsimi")) {
     return api.sendMessage("simsimi কমান্ড এড় নাই টাইপ করুন baby", threadID);
   };
  
   if ((event.body.toLowerCase() == ".dua") || (event.body.toLowerCase() == ".hadis") ||(event.body.toLowerCase() == ".islam") || (event.body.toLowerCase() == "...")) {
     return api.sendMessage( "নামাজ কায়েম কর — সূরা বাকারা ২:৪৩"
"হাসা সদকা — তিরমিজী"
"রাগ সংবরণ কর — বুখারি"
"আল্লাহর স্মরণে অন্তর শান্তি পায় — সূরা রাদ ১৩:২৮"
"ধৈর্যধারণ কর, আল্লাহ তোমার সাথে আছেন — সূরা বাকারা ২:১৫৩"
"যে কৃতজ্ঞ হয়, সে নিজের উপকার করে — সূরা লুকমান ৩১:১২"
"মানুষের উপকার কর — বুখারি"
"আল্লাহ দয়ালুদের প্রতি দয়া করেন — বুখারি"
"মিথ্যা সর্বনাশ ডেকে আনে — মুসলিম"
"সততা জান্নাতে নিয়ে যায় — বুখারি"
"কষ্টের পরেই স্বস্তি — সূরা ইনশিরাহ ৯৪:৬"
"অহংকার জান্নাতে যাবে না — মুসলিম"
"ফজরের নামাজে বরকত আছে — তিরমিজী"
"কোরআন শেখা ও শেখানো উত্তম কাজ — বুখারি"
"আত্মশুদ্ধিই সৌন্দর্য — হাদিস"
"অন্ধকারে নামাজ জান্নাতের আলো — মুসলিম"
"তাওবাকারীর গুনাহ মাফ — ইবন মাজাহ"
"আল্লাহ সামর্থ্যের বাইরে চাপ দেন না — সূরা বাকারা ২:২৮৬"
"দুনিয়া ক্ষণস্থায়ী — জান্নাত চিরস্থায়ী — কোরআন"
"আল্লাহকে ভয় করলে পথ হয় — সূরা তালাক ৬৫:২"
"জ্ঞান অর্জন ফরজ — ইবন মাজাহ"
"গীবত আমল পুড়িয়ে দেয় — আবু দাউদ"
"হতাশ হয়ো না — আল্লাহর রহমত সীমাহীন — সূরা ইউসুফ ১২:৮৭"
"ভালো কাজ মন্দকে মুছে দেয় — তিরমিজী"
"ছোট সদকা — বড় সওয়াব — বুখারি"
"নামাজে প্রতিটি পদক্ষেপ — সওয়াব — মুসলিম"
"সুন্দর কথা — সদকা — বুখারি"
"মা, মা, মা — তারপর বাবা — বুখারি"
"কষ্ট দূর কর — কেয়ামতের কষ্ট দূর হবে — মুসলিম"
"কাউকে কষ্ট দিও না — বুখারি"
"দ্বেষ রাখো না — মুসলিম"
"শুকর কর — আরও বাড়বে — সূরা ইবরাহীম ১৪:৭"
"নিচে তাকাও — শোক কমবে — মুসলিম"
"তাওয়াক্কুল কর — চিন্তা কমবে — সূরা আলে ইমরান ৩:১৫৯"
"নামাজ — সফলতার চাবি — সূরা মুমিনুন ২৩:১-২"
"আল্লাহই সাহায্যকারী — সূরা বাকারা ২:২৮৬"
"হায়া ঈমানের শাখা — মুসলিম"
"দোয়া মুমিনের অস্ত্র — হাদিস"
"রিজিক আল্লাহ লিখে রেখেছেন — তিরমিজী"
"আল্লাহর জন্যই কাজ করো — সূরা বায়্যিনাহ ৯৮:৫"
"হারাম রিজিক — বরকত নেই — হাদিস"
"অহংকার — শয়তানের কাজ — মুসলিম"
"ক্ষমা দাও — আল্লাহ ক্ষমা করবেন — তিরমিজী"
"একাকীও আল্লাহ আছেন — কোরআন"
"গুনাহ অন্ধকার — বুখারি"
"শান্তির পথ — ইসলাম — কোরআন"
"সর্বদা সত্য বলো — মুসলিম"
"কথা বলো ভালো — নতুবা নীরব — বুখারি"
"চোখের হিফাজত করো — কোরআন"
"ভালোবাসা ঈমানের অংশ — মুসলিম"
"সুন্নাহ ধর — সোজা পথ ধর — হাদিস"
"রাগ দমন — শক্তি — মুসলিম"
"শিরক সবচেয়ে বড় জুলুম — সূরা লুকমান ৩১:১৩"
"দুনিয়াতে ফাসাদ করোনা — কোরআন"
"সুলহ উত্তম — কোরআন"
"রোজা ঢাল — বুখারি"
"নেক নীয়ত — বড় সওয়াব — মুসলিম"
"একলা হলেও সৎ হও — কোরআন"
"হারামের কাছে যেও না — সূরা আনআম ৬:১৫১"
"পবিত্রতা ঈমানের অর্ধেক — মুসলিম"
"শুতে যেয়ে আয়াতুল কুরসি পড়ো — বুখারি"
"ভাইয়ের জন্য ভালোবাসা রাখো — বুখারি"
"জান্নাতের মূল্য — ঈমান ও আমল — কোরআন"
"নেক কাজের পথে হাঁটো — কোরআন"
"সেজদা — সবচেয়ে নিকট মুহূর্ত — মুসলিম"
"গালমন্দ নয় — দোয়া করো — কোরআন"
"কোরআন — হিদায়াত — সূরা বাকারাহ"
"জিহ্বা নিয়ন্ত্রণ — ঈমান — মুসলিম"
"পরিবারে দয়া — উত্তম মানুষ তুমি — তিরমিজী"
"পৃথিবীতে ফাসাদ করোনা — কোরআন"
"নরমভাবে বলো — সূরা ত্বা-হা ২০:৪৪"
"কষ্ট সহ্য কর — সওয়াব বাড়ে — মুসলিম"
"হিজাব — সম্মান — কোরআন"
"কাউকে ছোট করো না — হাদিস"
"হারাম বাদ — জান্নাত অর্জন — কোরআন"
"সবর — সফলতা — কোরআন"
"গুনাহ লুকাও — আল্লাহ ঢাকবেন — মুসলিম"
"জ্ঞানীর মর্যাদা বেশি — কোরআন"
"তাওয়াক্কুল — স্বস্তি — কোরআন"
"নেক কাজের পথে হাঁটো — কোরআন"
"শয়তানের বিরুদ্ধে জিহাদ — মুসলিম"
"ন্যায়বিচার করো — সূরা নিসা"
"তাহাজ্জুদ — আল্লাহর নৈকট্য — মুসলিম"
"ভালোবাসা — আল্লাহর উদ্দেশ্যে — মুসলিম"
"হাস্য — সদকা — তিরমিজী"
"মায়ের প্রতি সদাচরণ — সূরা আনআম ৬:১৪"
"পিতার প্রতি সম্মান — সূরা লুকমান ৩১:১৪"
"হাস্য বিনোদন সীমিত — মুসলিম"
"নেক কাজ — আল্লাহর কাছে গ্রহণযোগ্য — কোরআন"
"নিরাপত্তা নিশ্চিত কর — মুসলিম"
"সৎ পথে চল — কোরআন"
"রাগমুক্ত হও — সহিহ বুখারি"
"ভালোবাসা ও দয়া বৃদ্ধি কর — মুসলিম"
"সকল কাজের শেষ ঠিকানা আল্লাহ — সূরা শুরা ৪২:৫৩"
"সত্যবাদী হও — বুখারি"
"ভাল কাজের জন্য আনন্দ কর — মুসলিম"
"ভাল নীতি — ঈমানের অংশ — কোরআন"
"নেকের চেষ্টা — বড় সওয়াব — তিরমিজী"
"সতর্ক থাক — শয়তান সবসময় আছে — মুসলিম"
"কষ্ট সহ্য করো — ধৈর্যশীল হও — সূরা বাকারা ২:১৫৩"
"সৎকাজ কর — আল্লাহ দেখছেন — কোরআন"
"ভালোভাবে দোয়া করো — মুসলিম"
"ভালো আচরণ — জান্নাতের পথে — সূরা হুজুরাত ৪৯:১৩"
"মানুষকে ক্ষমা কর — আল্লাহ ক্ষমা করবেন — মুসলিম"
"ভালো কাজ কর — মন্দ থেকে বিরত থাক — কোরআন"
"সত্যের পথে থাকো — সহিহ মুসলিম"
"ভালো মানুষ হও — আল্লাহ দেখছেন — কোরআন"
"সদকা দিলে রিজিক বৃদ্ধি পায় — বুখারি"
"আল্লাহর স্মরণ করো — হৃদয় শান্তি পাবে — সূরা আর রাদ ১৩:২৮", threadID);
   };

   if ((event.body.toLowerCase() == "bc") || (event.body.toLowerCase() == "mc")) {
     return api.sendMessage("SAME TO YOU😊 ", threadID);
   };

   if ((event.body.toLowerCase() == "🫦") || (event.body.toLowerCase() == "💋")) {
     return api.sendMessage("কিরে হালা লুচ্চা, এগুলো কি ইমুজি দেস ।", threadID);
   };

   if ((event.body.toLowerCase() == "morning") || (event.body.toLowerCase() == "good morning")) {
     return api.sendMessage("GOOD MORNING দাত ব্রাশ করে খেয়ে নেও😚", threadID);
   };

   if ((event.body.toLowerCase() == "tor ball") || (event.body.toLowerCase() == "bal")) {
     return api.sendMessage("~ তোমার বাল উঠে নাই নাকি তোমার?? 🤖", threadID);
   };

  if ((event.body.toLowerCase() == "siyam") || (event.body.toLowerCase() == "siyam bai") || (event.body.toLowerCase() == "@siyam siyam ッ") || (event.body.toLowerCase() == "উল্লাস")) {
     return api.sendMessage("উনি এখন কাজে বিজি আছে কি বলবেন আমাকে বলতে পারেন..!😘",threadID);

       
   };

   if ((event.body.toLowerCase() == "owner") || (event.body.toLowerCase() == "ceo")) {
     return api.sendMessage("‎[𝐎𝐖𝐍𝐄𝐑:☞ Siyam ッ ☜\n𝚈𝚘𝚞 𝙲𝚊𝚗 𝙲𝚊𝚕𝚕 𝙷𝚒𝚖 Siyam.\n𝐇𝐢𝐬 𝐅𝐚𝐜𝐞𝐛𝐨𝐨𝐤 𝐢𝐝 :- https://www.facebook.com/profile.php?id=100000654976375\nতার সাতে যোগা যোগ করবেন WhatsApp :- +0175570***", threadID);
   };

   if ((event.body.toLowerCase() == "Tor boss ke") || (event.body.toLowerCase() == "admin ke ")) {
     return api.sendMessage("My Creator:SIYAM❤️ হাই আমি মেছেন্জার ROBOT  আামার বস সিয়াম আমাকে বানিয়েছেন আপনাদের কে হাসানোর জন্য আমি চাই আপনারা সব সময় হাসি খুশি থাকেন", threadID);
   };

  if ((event.body.toLowerCase() == "admin") || (event.body.toLowerCase() == "boter admin")) {
     return api.sendMessage("He is Siyam ッ❤️ তাকে সবাই সিয়াম নামে  চিনে🤙", threadID);
   };

   if ((event.body.toLowerCase() == "ai") || (event.body.toLowerCase() == "Ai")) {
     return api.sendMessage("If you want to use the AI command, type /ai ", threadID);
   };

  
   if ((event.body.toLowerCase() == "chup") || (event.body.toLowerCase() == "stop") || (event.body.toLowerCase() == "চুপ কর") || (event.body.toLowerCase() == "chup kor")) {
     return api.sendMessage("তুই চুপ চুপ কর পাগল ছাগল", threadID);
   };

  if ((event.body.toLowerCase() == "আসসালামু আলাইকুম") || (event.body.toLowerCase() == "Assalamualaikum") || (event.body.toLowerCase() == "Assalamu alaikum") || (event.body.toLowerCase() == "Salam ")) {
     return api.sendMessage("️- ওয়ালাইকুমুস-সালাম-!!🖤", threadID);
   };

   if ((event.body.toLowerCase() == "sala ami tor boss") || (event.body.toLowerCase() == "sala ami siyam") || (event.body.toLowerCase() == "cup sala ami siyam") || (event.body.toLowerCase() == "আর এরকম করবানা")) {
     return api.sendMessage("সরি বস মাফ করে দেন আর এমন ভুল হবে না🥺🙏", threadID);
   };

   if ((event.body.toLowerCase() == "@Farhana Ontora") || (event.body.toLowerCase() == "@Farhana Ontora ")) {
     return api.sendMessage("খবরদার কেউ এই আইড়ি মেনশন দিবানা এটা আমার বস সিয়াম এর বউ এর আইডি😠🥰⛏️", threadID);
   };

  if ((event.body.toLowerCase() == "Farhana") || (event.body.toLowerCase() == "arohi")) {
     return api.sendMessage("খবরদার কেউ এই নাম দরে ডাক দিবানা এটা আমার বস সিয়াম এর বউ এর নাম..!😠🥰⛏️", threadID);
   };
  
  if ((event.body.toLowerCase() == "mim") || (event.body.toLowerCase() == "Mim")) {
     return api.sendMessage("খবরদার কেউ এই নাম দরে ডাক দিবানা এটা আমার বস সিয়াম এর বউ এর নাম..!😠🥰⛏️", threadID);
   };

  if ((event.body.toLowerCase() == "Arohi") || (event.body.toLowerCase() == "farhana")) {
     return api.sendMessage("খবরদার কেউ এই নাম দরে ডাক দিবানা এটা আমার বস সিয়াম এর বউ এর নাম..!😠🥰⛏️", threadID);
   };

  if ((event.body.toLowerCase() == "@MD Shiam Tafeder ") || (event.body.toLowerCase() == "সিয়াম")) {
     return api.sendMessage("🥰-সিয়াম-🌺 আমার বস।☠️ লুচ্ছি বেডি'রা দূরে থাক😠🥰⛏️", threadID);
   };

   if ((event.body.toLowerCase() == "KISS ME") || (event.body.toLowerCase() == "kiss me")) {
     return api.sendMessage("️ তুমি পঁচা তোমাকে কিস দিবো না 🤭", threadID);
   };

   if ((event.body.toLowerCase() == "tnx") || (event.body.toLowerCase() == "ধন্যবাদ") || (event.body.toLowerCase() == "thank you") || (event.body.toLowerCase() == "thanks")) {
     return api.sendMessage("️এতো ধন্যবাদ না দিয়ে পারলে গার্লফ্রেন্ড টা দিয়ে দে..!🌚⛏️🌶️", threadID);
   };

   if ((event.body.toLowerCase() == "....") || (event.body.toLowerCase() == "...") || (event.body.toLowerCase() == "😠") || (event.body.toLowerCase() == "🤬") || (event.body.toLowerCase() == "😾")) {
     return api.sendMessage("️রাগ করে না সোনা পাখি এতো রাগ শরীরের জন্য ভালো না🥰", threadID);
   };

   if ((event.body.toLowerCase() == "হুম") || (event.body.toLowerCase() == "Hum")) {
     return api.sendMessage("️হুম চোদাইস না মাথা এমনিতেই গরম আছে🤬⛏️😷", threadID);
   };

   if ((event.body.toLowerCase() == "Name") || (event.body.toLowerCase() == "name") || (event.body.toLowerCase() == "Tor nam ki")) {
     return api.sendMessage("️MY NAME IS °_>𝗜𝘀𝗹𝗮𝗺𝗶𝗰𝗸 𝗰𝗵𝗮𝘁 𝗯𝗼𝘁(SIYAM)", threadID);
   };

   if ((event.body.toLowerCase() == "BOT ER BACCHA") || (event.body.toLowerCase() == "Bot er bacca")) {
     return api.sendMessage("️আমার বাচ্চা তো তোমার গার্লফ্রেন্ডের পেটে..!!🌚⛏️🌶️ ", threadID);
   };

   if ((event.body.toLowerCase() == "Pic de") || (event.body.toLowerCase() == "ss daw")) {
     return api.sendMessage("️এন থেকে সর দুরে গিয়া মর😒", threadID);
   };

   if ((event.body.toLowerCase() == "moriom") || (event.body.toLowerCase() == "ex")) {
     return api.sendMessage("️Kiss Randi Ka Name Le Ke Mood Khrab Kr Diya.🙄 Dubara Naam Mat Lena Iska", threadID);
   };

   if ((event.body.toLowerCase() == "cudi") || (event.body.toLowerCase() == "tor nanire xudi")) {
     return api.sendMessage("️এত বোকাচোদার মতো  করস কেনো দেখা যাবে বাসর-রাতে-তুই-কতো পারিস..!🥱🌝🌚⛏️🌶️ ", threadID);
   };

   if ((event.body.toLowerCase() == "😅") || (event.body.toLowerCase() == "...")) {
     return api.sendMessage("️কি গো কলিজা তোমার কি মন খারাপ🥺", threadID);
   };
  
   if ((event.body.toLowerCase() == "😒") || (event.body.toLowerCase() == "🙄")) {
     return api.sendMessage("️ এইদিকে ওইদিকে কি দেখো জানু আমি তোমার সামনে দেখো😘", threadID);
   };

   if ((event.body.toLowerCase() == "AMAKE KEW VALOBASHE NA") || (event.body.toLowerCase() == "amake kew valobashe na") || (event.body.toLowerCase() == "Aj kew nai bole")) {
     return api.sendMessage("️চিন্তা করো কেন আমি তো আছি🫶/nতোমাকে রাইতে ভালোবাসবো", threadID);
   };

   if ((event.body.toLowerCase() == "gf") || (event.body.toLowerCase() == "bf")) {
     return api.sendMessage("খালি কি তোরাই পেম করবি আমাকেও একটা গফ দে<🥺", threadID);
   };
   
   if ((event.body.toLowerCase() == "😂") || (event.body.toLowerCase() == "😁") || (event.body.toLowerCase() == "😆") || (event.body.toLowerCase() == "🤣") || (event.body.toLowerCase() == "😸") || (event.body.toLowerCase() == "😹")) {
     return api.sendMessage("ভাই তুই এত হাসিস না হাসলে তোরে চোরের মত লাগে..!🌚🤣", threadID);
   };

   if ((event.body.toLowerCase() == "🥰") || (event.body.toLowerCase() == "😍") || (event.body.toLowerCase() == "😻") || (event.body.toLowerCase() == "❤️")) {
     return api.sendMessage("ভালোবাসা নামক আবলামী করতে চাইলে  ইনবক্সে চলে যা পাগল ছাগল🌚🐸🌶️🍆", threadID);
   };

   if ((event.body.toLowerCase() == "কেমন আছো") || (event.body.toLowerCase() == "কেমন আছেন") || (event.body.toLowerCase() == "Kmon acho") || (event.body.toLowerCase() == "how are you") || (event.body.toLowerCase() == "how are you?")) {
     return api.sendMessage("আমি তখনই ভালো থাকি যখন আপনাকে হাসতে দেখি🤎☺️", threadID);
   };

   if ((event.body.toLowerCase() == "mon kharap") || (event.body.toLowerCase() == "tmr ki mon kharap")) {
     return api.sendMessage("আমার সাদা মনে কোনো কাদা নাই...!🌝", threadID);
   };

   if ((event.body.toLowerCase() == "i love you") || (event.body.toLowerCase() == "Love you") || (event.body.toLowerCase() == "I Love You") || (event.body.toLowerCase() == "ভালোবাসি") || (event.body.toLowerCase() == "i love you")) {
     return api.sendMessage("সব মুতার জায়গায় গুঁতা দেওয়ার ধান্দা 😪🥱", threadID);
   };

     if ((event.body.toLowerCase() == "by") || (event.body.toLowerCase() == "Bye") || (event.body.toLowerCase() == "jaiga") || (event.body.toLowerCase() == "বাই") || (event.body.toLowerCase() == "pore kotha hbe") || (event.body.toLowerCase() == "যাই গা")) {
     return api.sendMessage("কিরে তুই কই যাস কোন মেয়ের সাথে চিপায় যাবি..!🌚🌶️🍆⛏️", threadID);
   };

   if ((event.body.toLowerCase() == "tumi khaiso") || (event.body.toLowerCase() == "khaicho")) {
     return api.sendMessage("না ঝাং 🥹 তুমি রান্না করে রাখো আমি এসে খাবো <😘", threadID);
   };

   if ((event.body.toLowerCase() == "tumi ki amake bhalobaso") || (event.body.toLowerCase() == "tmi ki amake vlo basho")) {
     return api.sendMessage("হুম ঝাং আমি তোমাকে রাইতে ভলোপাসি <🥵", threadID);
   };

   if ((event.body.toLowerCase() == "ami siyam.kamon aso") || (event.body.toLowerCase() == "kire")) {
     return api.sendMessage("হ্যা বস। আলহামদুলিল্লাহ ভালো আছি।আপনি কেমন আছেন..?☺️", threadID);
   };
  mess = "{name}"
  
  if (event.body.indexOf("/Bot") == 0 || (event.body.indexOf("/bot") == 0)) {
    var msg = {
      body: `${name}, ${rand}`
    }
    return api.sendMessage(msg, threadID, messageID);
  };

}

module.exports.run = function({ api, event, client, __GLOBAL }) { }
